Repository: turulomio/renamebyreplace
Catalog: renamebyreplace/locale/*.po
Languages: es, fr

source: Rename files searching substrings in filenames
es: Renombra ficheros buscando subcadenas en los nombres
fr: Renommer les fichiers en cherchant des sous-chaînes dans les noms de fichiers

source: String to search
es: Cadena a buscar
fr: Chaîne à rechercher

source: String to replace
es: Cadena a reemplazar
fr: Chaîne de remplacement

source: Renames the files
es: Renombra los ficheros
fr: Renomme les fichiers

source: Undo replace command
es: Deshace el comando de reemplazo
fr: Annuler la commande de remplacement

source: Changes have been made ;).
es: Los cambios se han realizado ;).
fr: Les modifications ont été effectuées ;).

source: Developed by Mariano Muñoz 2018-{}
es: Desarrollado por Mariano Muñoz 2018-{}
fr: Développé par Mariano Muñoz 2018-{}

source: New Release:
es: Nueva versión:
fr: Nouvelle sortie :

source: * Create a new issue and its branch in Github
es: * Crea una nueva incidencia y su rama en Github
fr: * Créer une nouvelle issue et sa branche sur Github

source: * Change to this branch pasting suggested code in Github
es: * Cambia a esta rama pegando el código sugerido en Github
fr: * Basculer sur cette branche en collant le code suggéré sur Github

source: * Change version and date in __init__.py
es: * Cambia la versión y la fecha en __init__.py
fr: * Changer la version et la date dans __init__.py

source: * Make a pull request to main branch
es: * Haz un pull request a la rama main
fr: * Faire une pull request vers la branche main

source: * Make a new tag in github
es: * Hacer un nuevo tag en GitHub
fr: * Faire un nouveau tag dans GitHub

source: * Create a new gentoo ebuild with the new version and install it
es: * Crea un nuevo ebuild de gentoo con la nueva versión e instálalo
fr: * Créer un nouvel ebuild Gentoo avec la nouvelle version et l'installer

source: * Upload to portage repository
es: * Subelo al repositorio del portage
fr: * Uploader au dépôt de portage

source: You need ttyrecgenerator installed to generate videos
es: Necesitas instalar 'ttyrecgenerator' para generar videos
fr: Il faut installer ttyrecgenerator pour générer des vidéos
