Repository: turulomio/renamebyreplace
Catalog: locale/*.po
Languages: es, fr

source: New Release:
es: Nueva versión:
fr: Nouvelle sortie :

source: * Change version and date in version.py
es: * Cambiar la versión y la fecha en version.py
fr: * Changer la version et la date dans version.py

source: * Edit Changelog in README
es: * Modificar el Changelog en README
fr: * Editer le Changelog dans le README

source: If changed restart from first python setup.py doc
es: Si se cambia, reiniciar desde el primer 'python setup.py doc'
fr: S'il y a eu modification, recommencer depuis le premier document python setup.py

source: * Make a new tag in github
es: * Hacer un nuevo tag en GitHub
fr: * Faire un nouveau tag dans GitHub

source: * Create a new gentoo ebuild with the new version
es: * Crea un nuevo ebuild de Gentoo con la nueva versión
fr: * Créer un nouveau ebuild Gentoo avec la nouvelle version

source: * Upload to portage repository
es: * Subelo al repositorio del portage
fr: * Uploader au dépôt de portage

source: Uninstall command only works in Linux
es: El comando 'uninstall' solo funciona en Linux
fr: La commande 'désinstaller' marche seulement sur Linux

source: DESCRIPTION
es: DESCRIPCIÓN
fr: LA DESCRIPTION

source: Change files and directories owner and permissions recursively.
es: Cambia el propietario y los permisos de ficheros y directorios recursivamente.
fr: Changer le propriétaire et les permissions des fichiers et des répertoires récursivement.

source: This app has the following mandatory parameters:
es: Esta aplicación tiene los siguientes parámetros obligatorios
fr: Cette application a les paramètres obligatoires suivants :

source: User used to change files owner.
es: Usuario usado para cambiar el propietario de los ficheros
fr: Utilisateur utilisé pour changer le propriétaire des fichiers.

source: It does nothing if it's not set
es: No hace nada si no se ha establecido
fr: Ca ne fait rien si ce n'est pas défini

source: Group used to change files owner group.
es: Grupo usado para cambiar el grupo del propietario del fichero
fr: Groupe utilisé pour changer le groupe propriétaire des fichiers.

source: File permissions in octal to be used.
es: Permisos del fichero en octal a usar
fr: Permissions du fichier en octal à utiliser.

source: Directory permissions in octal to be used.
es: Permisos del directorio en octal a usar
fr: Permissions du répertoire en octal à utiliser.

source: When used in script, removes all empty dirs recursively from path.
es: Cuando se usa en el script, borra todos los directorios vacios rescursivamente desde la ruta
fr: A l'utilisation par un script, retire récursivement tous les répertoires vides dans le path.

source: Only changes permissions to the file or directory passed in absolute_path parameter.
es: Solo cambia los permisos del fichero o directorio pasado en el parámetro absolute_path.
fr: Change seulement les permissions du fichier ou du répertoire passé dans le paramètre absolute_path.

source: To avoid errors and wrong changes, path must be an absolute one.
es: Para evitar errores y cambios erróneos, la ruta pasada debe ser absoluta
fr: Pour éviter les erreurs et les changements erronés, le path doit être absolu.

source: EXAMPLES
es: EJEMPLOS
fr: EXEMPLES

source: Null Example
es: Ejemplo nulo
fr: Exemple nul

source: This comand does nothing
es: Este comando no hace nada
fr: Cette commande ne fait rien

source: Partial Example
es: Ejemplo parcial
fr: Exemple partiel

source: This command only changes user permissions and files permissions to 644. Group and directory permissions are not changed:
es: Este comando solo cambia el usuario y los permisos del fichero a 644. El grupo y los permisos de los directorios no son cambiados:
fr: Cette commande ne change à 644 que les permissions utilisateur et les permissions des fichiers. Les permissions de groupe et de répertoire ne sont pas modifiées :

source: Full Example
es: Ejemplo completo
fr: Exemple total

source: This command will change user and group to root user and group. Files will have rw-r----- permisions and directories rwxr-x--- permisions. If the script finds empty dirs it will remove them:
es: Este comando cambiará el usuario a 'root' y el grupo a 'root'. Los ficheros tendrán los permisos rw-r----- y los directorios los permisos rwxr-x---. Si el script encontrara directorios vacios los borrará:
fr: Cette commande va transformer l'utilisateur et le groupe en utilisateur root et groupe root. Les fichiers auront les permissions rw-r----- et les répertoires auront les permissions rwxr-x---. Si le script trouve des répertoires vides, il les enlèvera :

source: Only Example
es: Ejemplo Only
fr: Exemple de Only

source: This command will change user ownership to the file /home/usr/README.txt only
es: Este comando cambiará únicamente el propietario del fichero /home/usr/README.txt
fr: Cette commande ne changera la possession de l'utilisateur seulement du fichier /home/usr/README.txt

source: You need ttyrecgenerator installed to generate videos
es: Necesitas instalar 'ttyrecgenerator' para generar videos
fr: Il faut installer ttyrecgenerator pour générer des vidéos

source: Change Linux permissions and ownership in one step. It can delete empty directories when necessary.
es: Cambia los permisos y el propietario de Linux en un paso. Puede borrar directorios vacios cuando sea necesario.
fr: Changer les permissions et possessions de Linux en une étape. Il peut supprimer les répertoires vides quand c'est nécessaire.

source: Developed by Mariano Muñoz 2018-{}
es: Desarrollado por Mariano Muñoz 2018-{}
fr: Développé par Mariano Muñoz 2018-{}

source: File owner will be changed to this parameter. It does nothing if it's not set.
es: El propietario del fichero será cambiado a este parámetro. No hace nada si no se establece.
fr: Le propriétaire du fichier prendra cette valeur. Cela ne fait rien si elle n'est pas définie.

source: File owner group will be changed to this parameter. It does nothing if it's not set.
es: El grupo del propietario del fichero será cambiado a este parámetro. No hace nada si no se establece.
fr: Le groupe propriétaire du fichier prendra cette valeur. Cela ne fait rien si elle n'est pas définie

source: File permissions to set in all files. It does nothing if it's not set.
es: Permisos del fichero a establecer en todos los ficheros. No hace nada si no se establece
fr: Permissions de fichier à attribuer à tous les fichiers. Cela ne fait rien si elles ne sont pas définies.

source: Directory permissions to set in all directories. It does nothing if it's not set.
es: Permisos del directorio a establecer en todos los directorios. No hace nada si no se establece
fr: Permissions de répertoire à attribuer à tous les répertoires. Cela ne fait rien si elles ne sont pas définies.

source: If it's established, removes empty directories recursivily from current path.
es: Si se establece, borra todos los directorios vacios recursivamente desde la ruta actual.
fr: Si c'est établi, enlève tous les répertoires vides récursivement dans le path actuel.

source: Directory who is going to be changed permissions and owner recursivily
es: Directorio desde el que se van a cambiar permisos y propietario de forma recursiva
fr: Répertoire dont on va changer les permissions et le propriétaire récursivement

source: Path parameter must be an absolute one
es: El parámetro debe ser una ruta absoluta
fr: Le paramètre de path doit être absolu

source: Seems you gave a bad octal string in --files or --directories parameters. Use format 644 or 755 for example.
es: Parece que has dado una cadena octal errónea en el parámetro --files o --directories. Usa el formato 644 o 755 por ejemplo.

source: RecPermissions summary:
es: Resumen de RecPermissions:
fr: Résumé de RecPermissions :

source: Directories found:
es: Directorios encontrados:
fr: Répertoires trouvés :

source: Files found:
es: Ficheros encontrados:
fr: Fichiers trouvés :

source: Directories changed:
es: Directorios cambiados:
fr: Répertoires changés :

source: Files changed:
es: Ficheros cambiados:
fr: Fichiers changés :

source: Directories deleted:
es: Directorios borrados:
fr: Répertoires supprimés :

source: {} error files:
es: {} errores en ficheros:
fr: {} erreurs dans les fichiers :

source: This is a video to show how to use 'recpermissions' command
es: Este video muestra como usar el comando 'recpermissions'
fr: C'est une vidéo pour montrer comment utiliser la commande 'recpermissions'

source: We list files with permissions and owners
es: Listamos los permisos y propietarios de los ficheros
fr: Nous listons les fichiers avec leurs permissions et leurs propriétaires

source: We want to change them to root:root owner. Files to 640 permissions, directories to 750. We want to remove empty directories too, so we use:
es: Queremos cambiarlos al propietario root:root. Los ficheros a los permisos 640 y los directorios a 750. Tambien queremos borrar los directorios vacios, por lo que usamos:
fr: Nous voulons les changer au propriétaires root:root. Les fichiers aux permissions 640, les répertoires à 750. Nous voulons enlever les répertoires vides aussi, donc nous utilisons :

source: We check the result
es: Comprobamos el resultado
fr: Nous vérifions le résultat

source: That's all
es: Eso es todo
fr: C'est tout
